// 1호선
export const Line1001_up = [];
export const Line1001_down = [...Line1001_up].reverse();

// 2호선
export const Line1002_up = [];
export const Line1002_down = [...Line1002_up].reverse();

// 3호선
export const Line1003_up = [
    "대화", "주엽", "정발산", "마두", "백석", "대곡", "화정", "원당", "원흥", "삼송", "지축", "구파발", "연신내",
    "불광", "녹번", "홍제", "무악재", "독립문", "경복궁", "안국", "종로3가", "을지로3가", "충무로", "동대입구",
    "약수", "금호", "옥수", "압구정", "신사", "고속터미널", "교대", "남부터미널", "양재", "매봉", "도곡", "대치",
    "학여울", "대청", "일원", "수서", "가락시장", "경찰병원", "오금"
];
export const Line1003_down = [...Line1003_up].reverse();

// 4호선
export const Line1004_up = [
    "진접", "오남", "별내별가람", "당고개", "상계", "노원", "창동", "쌍문", "수유", "미아", "미아사거리", "길음",
    "성신여대입구", "한성대입구", "혜화", "동대문", "동대문역사문화공원", "충무로", "명동", "회현", "서울역",
    "숙대입구", "삼각지", "신용산", "이촌", "동작", "총신대입구(이수)", "사당", "남태령", "선바위", "경마공원",
    "대공원", "과천", "정부과천청사", "인덕원", "평촌", "범계", "금정", "산본", "수리산", "대야미", "반월",
    "상록수", "한대앞", "중앙", "고잔", "초지", "안산", "신길온천", "정왕", "오이도"
];
export const Line1004_down = [...Line1004_up].reverse();

// 5호선
export const Line1005_up = [];
export const Line5Stations_down = [...Line1005_up].reverse();

// 6호선
export const Line1006_up = [];
export const Line1006_down = [...Line1006_up].reverse();

// 7호선
export const Line1007_up = [
    "장암", "도봉산", "수락산", "마들", "노원", "중계", "하계", "공릉", "태릉입구", "먹골", "중화", "상봉", "면목",
    "사가정", "용마산", "중곡", "군자(능동)", "어린이대공원", "건대입구", "뚝섬유원지", "청담", "강남구청", "학동",
    "논현", "반포", "고속터미널", "내방", "총신대입구(이수)", "남성", "숭실대입구", "상도", "장승배기", "신대방삼거리",
    "보라매", "신풍", "대림", "남구로", "가산디지털단지", "철산", "광명사거리", "천왕", "온수", "부천종합운동장",
    "까치울", "부천시청", "신중동", "춘의", "부천종합운동장", "부평구청"
];
export const Line1007_down = [...Line1007_up].reverse();

// 8호선
export const Line1008_up = [
    "암사", "천호", "강동구청", "몽촌토성", "잠실", "석촌", "송파", "가락시장", "문정", "장지", "복정", "남위례",
    "산성", "남한산성입구", "단대오거리", "신흥", "수진", "모란"
];
export const Line1008_down = [...Line1008_up].reverse();

// 9호선
export const Line1009_up = [
    "개화", "김포공항", "공항시장", "신방화", "마곡나루(마곡택지)", "양천향교", "가양", "증미", "등촌", "염창", "신목동",
    "선유도", "당산", "국회의사당", "여의도", "샛강", "노량진", "흑석", "동작", "구반포", "신반포", "고속터미널", "사평",
    "신논현", "언주", "선정릉", "삼성중앙", "봉은사", "종합운동장", "삼전", "석촌고분", "석촌", "송파나루", "한성백제",
    "올림픽공원", "둔촌오륀", "중앙보훈병원"
];
export const Line1009_down = [...Line1009_up].reverse();

// 경의중앙선
export const Line1063_up = [];
export const Line1063_down = [...Line1063_up].reverse();

// 공항철도
export const Line1065_up = [
    "서울역", "공덕", "홍대입구", "디지털미디어시티", "마곡나루", "김포공항", "계양", "검암",
    "청라국제도시", "영종", "운서", "공항화물청사", "인천공항1터미널", "인천공항2터미널"
];
export const Line1065_down = [...Line1065_up].reverse();

// 경춘선
export const Line1067_up = [
    "청량리", "회기", "중랑", "상봉", "망우", "신내", "갈매", "별내", "퇴계원", "사릉", "금곡", "평내호평",
    "천마산", "마석", "대성리", "청평", "상천", "가평", "굴봉산", "백양리", "강촌", "김유정", "남춘천", "춘천"
];
export const Line1067_down = [...Line1067_up].reverse();

// 수인분당선
export const Line1075_up = [
    "인천", "신포", "숭의", "인하대", "송도", "연수", "원인재", "남동인더스파크", "호구포", "인천논현",
    "소래포구", "월곶", "달월", "오이도", "정왕", "신길온천", "안산", "초지", "고잔", "중앙", "한대앞", "사리",
    "야목", "어천", "오목천", "고색", "수원", "매교", "수원시청", "매탄권선", "망포", "영통", "청명", "상갈",
    "기흥", "신갈", "구성", "보정", "죽전", "오리", "미금", "정자", "수내", "서현", "이매", "야탑", "태평",
    "가천대", "복정", "수서", "대모산입구", "개포동", "구룡", "도곡", "한티", "선릉", "강남구청", "압구정로데오",
    "서울숲", "왕십리", "청량리"
];
export const Line1075_down = [...Line1075_up].reverse();

// 신분당선
export const Line1077_up = [
    "광교", "광교중앙", "상현", "성복", "수지구청", "동천", "미금", "정자", "판교", "청계산입구",
    "양재시민의숲", "양재", "강남", "신논현", "논현", "신사"
];
export const Line1077_down = [...Line1077_up].reverse();

// 우이신설선
export const Line1092_up = [
    "신설동", "보문", "성신여대입구", "정릉", "북한산보국문", "솔샘", "삼양사거리", "삼양", "화계",
    "가오리", "4.19민주묘지", "솔밭공원", "북한산우이"
];
export const Line1092_down = [...Line1092_up].reverse();

// GTX-A
export const Line1032_up = [];
export const Line1032_down = [...Line1032_up].reverse();