// 1호선
// 1호선 신도림-연천(전체) v
export const Line1001_up_1 = [
    "신도림", "영등포", "신길", "대방", "노량진", "용산", "남영", "서울역", "시청", "종각",
    "종로3가", "종로5가", "동대문", "동묘앞", "신설동", "제기동", "청량리", "회기", "외대앞",
    "신이문", "석계", "광운대", "월계", "녹천", "창동", "방학", "도봉", "도봉산", "망월사",
    "회룡", "의정부", "가능", "녹양", "양주", "덕계", "덕정", "지행", "동두천중앙", "보산",
    "동두천", "소요산", "청산", "전곡", "연천"
];
export const Line1001_down_1 = [...Line1001_up_1].reverse();
// 1호선 인천-구로
export const Line1001_up_2 = [
    "인천", "동인천", "도원", "제물포", "도화", "주안", "간석", "동암", "백운", "부평",
    "부개", "송내", "중동", "부천", "소사", "역곡", "온수", "오류동", "개봉", "구일", "구로"
];
export const Line1001_down_2 = [...Line1001_up_2].reverse();
// 1호선 광명-구로
export const Line1001_up_3 = [
    "광명", "금천구청", "독산", "가산디지털단지", "구로"
];
export const Line1001_down_3 = [...Line1001_up_3].reverse();
// 1호선 서동탄-구로
export const Line1001_up_4 = [
    "서동탄", "병점", "세류", "수원", "화서", "성균관대", "의왕", "당정", "군포", "금정",
    "명학", "안양", "관악", "석수", "금천구청", "독산", "가산디지털단지", "구로"
];
export const Line1001_down_4 = [...Line1001_up_4].reverse();
// 1호선 신창-구로
export const Line1001_up_5 = [
    "신창", "온양온천", "배방", "탕정", "아산", "쌍용", "봉명", "천안", "두정", "직산",
    "성환", "평택", "평택지제", "서정리", "송탄", "진위", "오산", "오산대", "세마",
    "병점", "세류", "수원", "화서", "성균관대", "의왕", "당정", "군포", "금정",
    "명학", "안양", "관악", "석수", "금천구청", "독산", "가산디지털단지", "구로"
];
export const Line1001_down_5 = [...Line1001_up_5].reverse();

// 2호선
// 2호선 순환선 v
export const Line1002_up_1 = [
    "구로디지털단지", "신대방", "신림", "봉천", "서울대입구", "낙성대", "사당", "방배", "서초", "교대",
    "강남", "역삼", "선릉", "삼성", "종합운동장", "잠실새내", "잠실", "잠실나루", "강변", "구의",
    "건대입구", "성수", "뚝섬", "한양대", "왕십리", "상왕십리", "신당", "동대문역사문화공원",
    "을지로4가", "을지로3가", "을지로입구", "시청", "충정로", "아현", "이대", "신촌", "홍대입구",
    "합정", "당산", "영등포구청", "문래", "신도림", "대림"
];
export const Line1002_down_1 = [...Line1002_up_1].reverse();
// 2호선 신도림-까치산
export const Line1002_up_2 = [
    "까치산", "신정네거리", "양천구청", "도림천", "신도림"
];
export const Line1002_down_2 = [...Line1002_up_2].reverse();
// 2호선 신설동-성수
export const Line1002_up_3 = [
    "성수", "용답", "신답", "용두", "신설동"
];
export const Line1002_down_3 = [...Line1002_up_3].reverse();

// 3호선
export const Line1003_up = [
    "오금", "경찰병원", "가락시장", "수서", "일원", "대청", "학여울", "대치", "도곡", "매봉",
    "양재", "남부터미널", "교대", "고속터미널", "잠원", "신사", "압구정", "옥수", "금호", "약수",
    "동대입구", "충무로", "을지로3가", "종로3가", "안국", "경복궁", "독립문", "무악재", "홍제", "녹번",
    "불광", "연신내", "구파발", "지축", "삼송", "원흥", "원당", "화정", "대곡", "백석",
    "마두", "정발산", "주엽", "대화"
];
export const Line1003_down = [...Line1003_up].reverse();

// 4호선
export const Line1004_up = [
    "오이도", "정왕", "신길온천", "안산", "초지", "고잔", "중앙", "한대앞", "상록수", "반월",
    "대야미", "수리산", "산본", "금정", "범계", "평촌", "인덕원", "정부과천청사", "과천", "대공원",
    "경마공원", "선바위", "남태령", "사당", "총신대입구", "동작", "이촌", "신용산", "삼각지", "숙대입구",
    "서울역", "회현", "명동", "충무로", "동대문역사문화공원", "동대문", "혜화", "한성대입구",
    "성신여대입구", "길음", "미아사거리", "미아", "수유", "쌍문", "창동", "노원", "상계", "당고개",
    "별내별가람", "오남", "진접"
];
export const Line1004_down = [...Line1004_up].reverse();

// 5호선
// 5호선 방화-하남검단산 v
export const Line1005_up_1 = [
    "하남검단산", "하남시청", "하남풍산", "미사", "강일", "상일동", "고덕", "명일", "굽은다리", "길동",
    "강동", "천호", "광나루", "아차산", "군자", "장한평", "답십리", "마장", "왕십리", "행당",
    "신금호", "청구", "동대문역사문화공원", "을지로4가", "종로3가", "광화문", "서대문", "충정로", "애오개", "공덕",
    "마포", "여의나루", "여의도", "신길", "영등포시장", "영등포구청", "양평", "오목교", "목동", "신정",
    "까치산", "화곡", "우장산", "발산", "마곡", "송정", "김포공항", "개화산", "방화"
];
export const Line1005_down_1 = [...Line1005_up_1].reverse();
// 5호선 방화-마천
export const Line1005_up_2 = [
    "마천", "거여", "개롱", "오금", "방이", "올림픽공원", "둔촌동", "강동", "천호", "광나루",
    "아차산", "군자", "장한평", "답십리", "마장", "왕십리", "행당", "신금호", "청구", "동대문역사문화공원",
    "을지로4가", "종로3가", "광화문", "서대문", "충정로", "애오개", "공덕", "마포", "여의나루", "여의도",
    "신길", "영등포시장", "영등포구청", "양평", "오목교", "목동", "신정", "까치산", "화곡", "우장산",
    "발산", "마곡", "송정", "김포공항", "개화산", "방화"
];
export const Line1005_down_2 = [...Line1005_up_2].reverse();

// 6호선
export const Line1006_up = [
    "신내", "봉화산", "화랑대", "태릉입구", "석계", "돌곶이", "상월곡", "월곡", "고려대", "안암",
    "보문", "창신", "동묘앞", "신당", "청구", "약수", "버티고개", "한강진", "이태원", "녹사평",
    "삼각지", "효창공원앞", "공덕", "대흥", "광흥창", "상수", "합정", "망원", "마포구청", "월드컵경기장",
    "디지털미디어시티", "증산", "새절", "응암"
];
export const Line1006_down = [
    "역촌", "불광", "독바위", "연신내", "구산", "응암", "새절", "증산", "디지털미디어시티", "월드컵경기장",
    "마포구청", "망원", "합정", "상수", "광흥창", "대흥", "공덕", "효창공원앞", "삼각지", "녹사평",
    "이태원", "한강진", "버티고개", "약수", "청구", "신당", "동묘앞", "창신", "보문", "안암",
    "고려대", "월곡", "상월곡", "돌곶이", "석계", "태릉입구", "화랑대", "봉화산", "신내"
];

// 7호선
export const Line1007_up = [
    "석남", "산곡", "부평구청", "굴포천", "삼산체육관", "상동", "부천시청", "신중동", "춘의", "부천종합운동장",
    "까치울", "온수", "천왕", "광명사거리", "철산", "가산디지털단지", "남구로", "대림", "신풍", "보라매",
    "신대방삼거리", "장승배기", "상도", "숭실대입구", "남성", "총신대입구", "내방", "고속터미널", "반포", "논현",
    "학동", "강남구청", "청담", "자양", "건대입구", "어린이대공원", "군자", "중곡", "용마산", "사가정",
    "면목", "상봉", "중화", "먹골", "태릉입구", "공릉", "하계", "중계", "노원", "마들",
    "수락산", "도봉산", "장암"
];
export const Line1007_down = [...Line1007_up].reverse();

// 8호선
export const Line1008_up = [
    "모란", "수진", "신흥", "단대오거리", "남한산성입구", "산성", "남위례", "복정", "장지", "문정",
    "가락시장", "송파", "석촌", "잠실", "몽촌토성", "강동구청", "천호", "암사", "암사역사공원", "장자호수공원",
    "구리", "동구릉", "다산", "별내"
];
export const Line1008_down = [...Line1008_up].reverse();

// 9호선
export const Line1009_up = [
    "중앙보훈병원", "둔촌오륜", "올림픽공원", "한성백제", "송파나루", "석촌", "석촌고분", "삼전", "종합운동장", "봉은사",
    "삼성중앙", "선정릉", "언주", "신논현", "사평", "고속터미널", "신반포", "구반포", "동작", "흑석",
    "노들", "노량진", "샛강", "여의도", "국회의사당", "당산", "선유도", "신목동", "염창", "등촌",
    "증미", "가양", "양천향교", "마곡나루", "신방화", "공항시장", "김포공항", "개화"
];
export const Line1009_down = [...Line1009_up].reverse();

// 경의중앙선
// 경의중앙선 문산-지평
export const Line1063_up_1 = [
    "지평", "용문", "원덕", "양평", "오빈", "아신", "국수", "신원", "양수", "운길산",
    "팔당", "도심", "덕소", "양정", "도농", "구리", "양원", "망우", "상봉", "중랑",
    "회기", "청량리", "왕십리", "응봉", "옥수", "한남", "서빙고", "이촌", "용산", "효창공원앞",
    "공덕", "서강대", "홍대입구", "가좌", "디지털미디어시티", "수색", "한국항공대", "강매", "행신", "능곡",
    "대곡", "곡산", "백마", "풍산", "일산", "탄현", "야당", "운정", "금릉", "금촌",
    "월롱", "파주", "문산"
];
export const Line1063_down_1 = [...Line1063_up_1].reverse();
// 경의중앙선 문산-서울역
export const Line1063_up_2 = [
    "서울역", "신촌", "가좌", "디지털미디어시티", "수색", "한국항공대", "강매", "행신", "능곡", "대곡",
    "곡산", "백마", "풍산", "일산", "탄현", "야당", "운정", "금릉", "금촌", "월롱",
    "파주", "문산"
];
export const Line1063_down_2 = [...Line1063_up_2].reverse();

// 공항철도
export const Line1065_up = [
    "인천공항2터미널", "인천공항1터미널", "공항화물청사", "운서", "영종", "청라국제도시", "검암", "계양", "김포공항", "마곡나루",
    "디지털미디어시티", "홍대입구", "공덕", "서울역"
];
export const Line1065_down = [...Line1065_up].reverse();

// 경춘선
// 경춘선 광운대-춘천
export const Line1067_up_1 = [
    "춘천", "남춘천", "김유정", "강촌", "백양리", "굴봉산", "가평", "상천", "청평", "대성리",
    "마석", "천마산", "평내호평", "금곡", "사릉", "퇴계원", "별내", "갈매", "신내", "망우",
    "상봉", "광운대"
];
export const Line1067_down_1 = [...Line1067_up_1].reverse();
// 경춘선 청량리-춘천
export const Line1067_up_2 = [
    "춘천", "남춘천", "김유정", "강촌", "백양리", "굴봉산", "가평", "상천", "청평", "대성리",
    "마석", "천마산", "평내호평", "금곡", "사릉", "퇴계원", "별내", "갈매", "신내", "망우",
    "상봉", "중랑", "회기", "청량리"
];
export const Line1067_down_2 = [...Line1067_up_2].reverse();

// 수인분당선
export const Line1075_up = [
    "인천", "신포", "숭의", "인하대", "송도", "연수", "원인재", "남동인더스파크", "호구포", "인천논현",
    "소래포구", "월곶", "달월", "오이도", "정왕", "신길온천", "안산", "초지", "고잔", "중앙",
    "한대앞", "사리", "야목", "어천", "오목천", "고색", "수원", "매교", "수원시청", "매탄권선",
    "망포", "영통", "청명", "상갈", "기흥", "신갈", "구성", "보정", "죽전", "오리",
    "미금", "정자", "수내", "서현", "이매", "야탑", "태평", "가천대", "복정", "수서",
    "대모산입구", "개포동", "구룡", "도곡", "한티", "선릉", "강남구청", "압구정로데오", "서울숲", "왕십리",
    "청량리"
];
export const Line1075_down = [...Line1075_up].reverse();

// 신분당선
export const Line1077_up = [
    "광교", "광교중앙", "상현", "성복", "수지구청", "동천", "미금", "정자", "판교", "청계산입구",
    "양재시민의숲", "양재", "강남", "신논현", "논현", "신사"
];
export const Line1077_down = [...Line1077_up].reverse();

// 우이신설선
export const Line1092_up = [
    "신설동", "보문", "성신여대입구", "정릉", "북한산보국문", "솔샘", "삼양사거리", "삼양", "화계",
    "가오리", "4.19민주묘지", "솔밭공원", "북한산우이"
];
export const Line1092_down = [...Line1092_up].reverse();

// GTX-A
export const Line1032_up = [
    "수서", "성남", "구성", "동탄"
];
export const Line1032_down = [...Line1032_up].reverse();
